Revit 2027 API
FamilyInstance.GetSweptProfile Method
Gets the object that describes the profile that is swept along the driving curve for this instance.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public SweptProfile GetSweptProfile()
Public Function GetSweptProfile As SweptProfile
public:
SweptProfile^ GetSweptProfile()
member GetSweptProfile : unit -> SweptProfile
Return Value
SweptProfile
A swept profile.
Exceptions
Exception | Condition
InapplicableDataException | Thrown if this instance does not have a swept profile.
See Also
Reference
FamilyInstance Class
Autodesk.Revit.DB Namespace